post/12.org
#+title: Weekly#12
#+INDEX: weekly!#12
#+date: <2024-10-13 Sun>
#+lastmod: <2024-10-13 Sun 11:00>
#+author: Spike Leung
#+email: l-yanlei@hotmail.com
#+description: ""
#+tags: weekly

#+begin_export html
<iframe style="width:320px;min-height:210px;" srcdoc="&lt;style&gt; ol { all: unset; display: grid; grid-template-columns: repeat(34, 1fr); grid-template-rows: repeat(21, 1fr); list-style: none; li { aspect-ratio: 1 / 1; background: var(--bg); grid-area: var(--ga); overflow: hidden; position: relative; &amp;::after { aspect-ratio: 1 / 1; background-color: rgba(255, 255, 255, .3); border-radius: 50%; content: &#39;&#39;; display: block; inset: 0; position: absolute; scale: 2; translate: var(--tl); } &amp;:nth-of-type(1) { --bg: #e47a2c; --ga: 1 / 1 / 22 / 22; --tl: 50% 50%; } &amp;:nth-of-type(2) { --bg: #baccc0 ; --ga: 1 / 22 / 23 / 35; --tl: -50% 50%; } &amp;:nth-of-type(3) { --bg: #6c958f; --ga: 14 / 27 / 22 / 35; --tl: -50% -50%; } &amp;:nth-of-type(4) { --bg: #40363f; --ga: 17 / 22 / 22 / 27; --tl: 50% -50%; } &amp;:nth-of-type(5) { --bg: #d7a26c; --ga: 14 / 22 / 17 / 25; --tl: 50% 50%; } &amp;:nth-of-type(6) { --bg: #ae4935; --ga: 14 / 25 / 17 / 27; --tl: -50% 50%; } &amp;:nth-of-type(7) { --bg: #e47a2c; --ga: 16 / 26 / 17 / 27; --tl: -50% -50%; } &amp;:nth-of-type(8) { --bg: #f7e6d4; --ga: 16 / 25 / 17 / 26; --tl: 50% -50%; } } } &lt;/style&gt; &lt;ol&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;/ol&gt; "></iframe>
#+end_export

* News | Article

** [[https://rxjourney.com.ng/all-we-really-have-in-this-world-is-ourselves][All We Really Have in This World Is Ourselves]]

#+begin_quote
但问题是：到了下午 4 点，我就会脱下大衣，告诉他们我要回家了。

只有当我正在进行一场精彩的谈话或享受同事们的陪伴时，我才会在下午 4 点之后继续工作。

我不会为了做更多的工作而加班，因为最终，没有我，工作也会继续。

我的同事会向我的家人表示慰问，并在社交媒体上发表对我的赞美之词，但很快，他们就会一切照旧。

我不会在没有报酬的情况下自杀式地加班。

生活是残酷的。生活是悲伤的。生活是孤独的。

有时，在家里，我只是想哭。
#+end_quote

看着作者的文字，觉得有些悲伤。

前阵子还看到一个帖子:  [[https://v2ex.com/t/1078509][父母不在了，是不是就四海为家了？]]，也是让人感到孤独和悲伤。

** [[https://depth-first.com/articles/2024/05/24/bridge-to-nowhere/][Bridge to Nowhere]]

作者在 2023 年 3 月 24 日确诊了[[https://www.wikiwand.com/zh/articles/%E8%83%B6%E8%B4%A8%E6%AF%8D%E7%BB%86%E8%83%9E%E7%98%A4][胶质母细胞瘤]]，目前这是一种绝症，预后存活时间都不长。

那时他说计划都被打乱了：

#+begin_quote
拳击手迈克-泰森（Mike Tyson）有一句名言：“每个人都有自己的计划，直到被人打了一拳”。 (Everyone has a plan until they get punched in the mouth.)

在随后的几周里，我多次思考这句话。这句话经常被拿来做比喻，比如在我混迹的创业圈子里。我也是这么理解的。

你制定了计划，然后现实就来了。面对现实吧。但我认为这并没有真正抓住泰森想要表达的精髓。

只有威胁到你人身安全的人身攻击，以及它给你带来的超负荷感官冲击，才会释放出真正的恐慌洪流，将最好的计划也撕成碎片。

这就是我那晚的感受。恐慌。

Hey tough guy, what's your plan now?

Plan? What the actual fuck just happened?

[[https://depth-first.com/articles/2023/05/18/everyone-has-a-plan/][Everyone Has a Plan]]
#+end_quote

这篇文章是作者博客的最新一篇，发布时间是 2024 年的 5 月 25 日，现在已经 10 月了，不知道作者如何了。

当我面临突如其来的重症，又会如何呢？

#+begin_quote
但更重要的是，我发现自己掉进了一个自己制造的陷阱。

我以为手术可以让我回到进入急诊室之前的生活。

我错误地认为我的选择是：拒绝手术，三个月后死去；或者接受手术，继续我熟悉的生活。

即使脑部手术有一定的风险，答案也是显而易见的。

这一点看似无关紧要，但却非常重要。

医生从来没有告诉过我，手术后我可以回到我熟悉的生活。

我是出于无知和恐惧才产生了这种想法。

今天，我会知道得更多。特别是我会知道问一些基本的后续问题。

比如："你给了我不做手术的预期寿命。如果做了手术，我的预期寿命有多长？"

另一个问题是："手术成功后可能会发生什么？"

我不确定我是否会做出不同的选择，但我的选择会更加明智。
#+end_quote

#+begin_quote
胶质母细胞瘤切除术是一座不通往任何地方的桥梁，因为手术后的一方是不完整的。

我们可以说，那边有路，但大多数情况下，路本身并不通向任何地方。

如果真的有路，胶质母细胞瘤就不会被诊断为绝症，像我这样的病人就能真正回到以前的生活。
#+end_quote

#+begin_quote
每年都有数以千计的不幸者被诊断出患有胶质母细胞瘤，他们应该在遭受折磨的最初几天得到比我的经验所显示的要好得多的治疗。

他们应该了解真相--所有的真相。他们应该被当作有能力的成年人对待。

他们不需要被呵护，仿佛不加修饰的真相会摧毁他们的求生意志。

他们不值得对下一代测序或个性化医疗的虚无赞美。

无论如何，请添加一些必要的措辞，说明不确定性和未知因素。

但无论如何，都不要掩盖基本事实。
#+end_quote

** [[https://zverok.space/blog/2024-10-06-poetry.html][On programming and poetry (not Python’s tool)]]

#+begin_quote
我们为什么要写作和阅读文学作品，任何文学作品？

主要是为了分享经历。一种去某个地方、经历某些事件、感受某些情绪、理解某些事情的体验。这种体验我们可能无法直接获取。

在这个定义的范围内，诗歌，一言以蔽之，是一种更有效地分享难以理性表达的经验的方式。

它依赖于某种理解上的“飞跃”，在这种情况下，一个精心制作的短语与五页密集的解释一样有效。
#+end_quote

#+begin_quote
*we can say that writing code is sharing the experience of understanding the requirements/implementation.*

*我们可以说，编写代码就是分享理解需求/实现的经验。*
#+end_quote

#+begin_quote
我希望看到更多的人以对待文学作品的心态来对待短语和“段落”（方法或语句组）层面上的代码。

我指的是一种视角，从这种视角出发，我们可以分析、讨论（也许还可以自学），从对潜在读者（包括人类和编译器/解释器）的影响的角度来思考

“在这种情况下，表达的含义是如何传达代码背后的思想的；是否可以用不同的方式来表达，以强调不同的方面”。

这种对话不像自动格式化和风格指南那么死板，也比抽象的“可读性”或“智能/简单代码”更加细致入微。
#+end_quote

** [[https://mwhittaker.github.io/blog/an_illustrated_proof_of_the_cap_theorem/][An Illustrated Proof of the CAP Theorem]]

CAP 定理的图解证明，比较容易懂。

** [[https://www.dreamsongs.com/RiseOfWorseIsBetter.html][The Rise of Worse is Better]]

#+begin_quote
从中可以学到的教训是，首先追求正确的事情往往是不理想的。

获取一半可用的正确事物更好，这样它就像病毒一样传播。

一旦人们对它上瘾，就花时间将其改进到 90% 的正确程度。
#+end_quote

