publish/12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Weekly#12</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="stylesheet" href="https://chinese-fonts-cdn.deno.dev/packages/lxgwwenkai/dist/LXGWWenKai-Regular/result.css" />
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
    <li><a href="https://music.163.com/#/playlist?id=12531191848">Playlist</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Weekly#12</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0d1c63b">News | Article</a>
<ul>
<li><a href="#orgf7ba991">All We Really Have in This World Is Ourselves</a></li>
<li><a href="#org3a22a4e">Bridge to Nowhere</a></li>
<li><a href="#orgb3272a3">On programming and poetry (not Python’s tool)</a></li>
<li><a href="#orgb5982cc">An Illustrated Proof of the CAP Theorem</a></li>
<li><a href="#orge1d47f2">The Rise of Worse is Better</a></li>
<li><a href="#org9a3de46">The Static Site Paradox</a></li>
<li><a href="#org873ca2c">A Local-First Case Study</a></li>
<li><a href="#org95f9376">How To Write More Blog Posts</a></li>
<li><a href="#org5978179">Searching for a New CSS Logo</a></li>
<li><a href="#orgd2aee9c">Why Gumroad Didn't Choose htmx</a></li>
<li><a href="#org2b31739">垫紫草的诱惑</a></li>
<li><a href="#orgce0d4c2">The Disappearance of an Internet Domain</a></li>
</ul>
</li>
<li><a href="#org6e7b20e">Tutorial</a>
<ul>
<li><a href="#org0e90cf9">How to write</a></li>
<li><a href="#org0c1c3d3">OKLCH in CSS: why we moved from RGB and HSL</a></li>
<li><a href="#org1aa4cd4">How to use the CSS backdrop-filter property</a></li>
<li><a href="#orge0577dd">CSS Anchor Positioning Guide</a></li>
<li><a href="#orgea4d085">Bad@CSS</a></li>
<li><a href="#orgf69367f">Beej's Guide to C Programming</a></li>
<li><a href="#org5df105b">Tutorial on Good Lisp Programming Style(1993)</a></li>
<li><a href="#org5299778">【高能干货】这个视频将会颠覆你对英语学习的认知——总述·阅读篇</a></li>
</ul>
</li>
<li><a href="#org5bf2ed9">Code</a>
<ul>
<li><a href="#org5e2e979">A simple timeline using CSS flexbox</a></li>
<li><a href="#org9c7d2e9">Do not use secrets in environment variables and here's how to do it better</a></li>
<li><a href="#org3231d23">Build A Static RSS Reader To Fight Your Inner FOMO</a></li>
</ul>
</li>
<li><a href="#orgee5837a">Cool Bit</a>
<ul>
<li><a href="#org4ad0d3e">The Golden Ratio in CSS</a></li>
<li><a href="#orgfd4bb87">Black hole shot a beam through space. NASA snapped stunning footage.</a></li>
<li><a href="#org7dae039">An Enormous Photo of the Moon Zooms in on the Cratered Lunar Topography in Incredible Detail</a></li>
</ul>
</li>
<li><a href="#org3287bcb">Tool | Library</a>
<ul>
<li><a href="#orgdb0e37a">ARIA DevTools</a></li>
<li><a href="#orgd5c198b">Kimi 浏览器助手</a></li>
<li><a href="#org1decbb2">zeli</a></li>
<li><a href="#orgb8440ee">Luxirty Search</a></li>
<li><a href="#org94978f6">JSON For You</a></li>
<li><a href="#orgc58930f">Confectionery</a></li>
<li><a href="#org4542d7b">docTR</a></li>
<li><a href="#org083a23e">Monologue - multilingual</a></li>
<li><a href="#org8ead703">player.style</a></li>
</ul>
</li>
<li><a href="#org7e458f9">一些话</a></li>
<li><a href="#orgfda883c">blog 推荐</a>
<ul>
<li><a href="#org1b870ff">7gugu's Blog</a></li>
<li><a href="#orgb1e0aea">996忍者！</a></li>
</ul>
</li>
<li><a href="#org85fa315">Music</a></li>
</ul>
</div>
</div>
<iframe style="width:320px;min-height:210px;" srcdoc="&lt;style&gt; ol { all: unset; display: grid; grid-template-columns: repeat(34, 1fr); grid-template-rows: repeat(21, 1fr); list-style: none; li { aspect-ratio: 1 / 1; background: var(--bg); grid-area: var(--ga); overflow: hidden; position: relative; &amp;::after { aspect-ratio: 1 / 1; background-color: rgba(255, 255, 255, .3); border-radius: 50%; content: &#39;&#39;; display: block; inset: 0; position: absolute; scale: 2; translate: var(--tl); } &amp;:nth-of-type(1) { --bg: #e47a2c; --ga: 1 / 1 / 22 / 22; --tl: 50% 50%; } &amp;:nth-of-type(2) { --bg: #baccc0 ; --ga: 1 / 22 / 23 / 35; --tl: -50% 50%; } &amp;:nth-of-type(3) { --bg: #6c958f; --ga: 14 / 27 / 22 / 35; --tl: -50% -50%; } &amp;:nth-of-type(4) { --bg: #40363f; --ga: 17 / 22 / 22 / 27; --tl: 50% -50%; } &amp;:nth-of-type(5) { --bg: #d7a26c; --ga: 14 / 22 / 17 / 25; --tl: 50% 50%; } &amp;:nth-of-type(6) { --bg: #ae4935; --ga: 14 / 25 / 17 / 27; --tl: -50% 50%; } &amp;:nth-of-type(7) { --bg: #e47a2c; --ga: 16 / 26 / 17 / 27; --tl: -50% -50%; } &amp;:nth-of-type(8) { --bg: #f7e6d4; --ga: 16 / 25 / 17 / 26; --tl: 50% -50%; } } } &lt;/style&gt; &lt;ol&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;li&gt;&lt;/li&gt; &lt;/ol&gt; "></iframe>

<div id="outline-container-org0d1c63b" class="outline-2">
<h2 id="org0d1c63b">News | Article</h2>
<div class="outline-text-2" id="text-org0d1c63b">
</div>
<div id="outline-container-orgf7ba991" class="outline-3">
<h3 id="orgf7ba991"><a href="https://rxjourney.com.ng/all-we-really-have-in-this-world-is-ourselves">All We Really Have in This World Is Ourselves</a></h3>
<div class="outline-text-3" id="text-orgf7ba991">
<blockquote>
<p>
但问题是：到了下午 4 点，我就会脱下大衣，告诉他们我要回家了。
</p>

<p>
只有当我正在进行一场精彩的谈话或享受同事们的陪伴时，我才会在下午 4 点之后继续工作。
</p>

<p>
我不会为了做更多的工作而加班，因为最终，没有我，工作也会继续。
</p>

<p>
我的同事会向我的家人表示慰问，并在社交媒体上发表对我的赞美之词，但很快，他们就会一切照旧。
</p>

<p>
我不会在没有报酬的情况下自杀式地加班。
</p>

<p>
生活是残酷的。生活是悲伤的。生活是孤独的。
</p>

<p>
有时，在家里，我只是想哭。
</p>
</blockquote>

<p>
看着作者的文字，觉得有些悲伤。
</p>

<p>
前阵子还看到一个帖子:  <a href="https://v2ex.com/t/1078509">父母不在了，是不是就四海为家了？</a>，也是让人感到孤独和悲伤。
</p>
</div>
</div>

<div id="outline-container-org3a22a4e" class="outline-3">
<h3 id="org3a22a4e"><a href="https://depth-first.com/articles/2024/05/24/bridge-to-nowhere/">Bridge to Nowhere</a></h3>
<div class="outline-text-3" id="text-org3a22a4e">
<p>
作者在 2023 年 3 月 24 日确诊了<a href="https://www.wikiwand.com/zh/articles/%E8%83%B6%E8%B4%A8%E6%AF%8D%E7%BB%86%E8%83%9E%E7%98%A4">胶质母细胞瘤</a>，目前这是一种绝症，预后存活时间都不长。
</p>

<p>
那时他说计划都被打乱了：
</p>

<blockquote>
<p>
拳击手迈克-泰森（Mike Tyson）有一句名言：“每个人都有自己的计划，直到被人打了一拳”。 (Everyone has a plan until they get punched in the mouth.)
</p>

<p>
在随后的几周里，我多次思考这句话。这句话经常被拿来做比喻，比如在我混迹的创业圈子里。我也是这么理解的。
</p>

<p>
你制定了计划，然后现实就来了。面对现实吧。但我认为这并没有真正抓住泰森想要表达的精髓。
</p>

<p>
只有威胁到你人身安全的人身攻击，以及它给你带来的超负荷感官冲击，才会释放出真正的恐慌洪流，将最好的计划也撕成碎片。
</p>

<p>
这就是我那晚的感受。恐慌。
</p>

<p>
Hey tough guy, what's your plan now?
</p>

<p>
Plan? What the actual fuck just happened?
</p>

<p>
<a href="https://depth-first.com/articles/2023/05/18/everyone-has-a-plan/">Everyone Has a Plan</a>
</p>
</blockquote>

<p>
这篇文章是作者博客的最新一篇，发布时间是 2024 年的 5 月 25 日，现在已经 10 月了，不知道作者如何了。
</p>

<p>
当我面临突如其来的重症，又会如何呢？
</p>

<blockquote>
<p>
但更重要的是，我发现自己掉进了一个自己制造的陷阱。
</p>

<p>
我以为手术可以让我回到进入急诊室之前的生活。
</p>

<p>
我错误地认为我的选择是：拒绝手术，三个月后死去；或者接受手术，继续我熟悉的生活。
</p>

<p>
即使脑部手术有一定的风险，答案也是显而易见的。
</p>

<p>
这一点看似无关紧要，但却非常重要。
</p>

<p>
医生从来没有告诉过我，手术后我可以回到我熟悉的生活。
</p>

<p>
我是出于无知和恐惧才产生了这种想法。
</p>

<p>
今天，我会知道得更多。特别是我会知道问一些基本的后续问题。
</p>

<p>
比如："你给了我不做手术的预期寿命。如果做了手术，我的预期寿命有多长？"
</p>

<p>
另一个问题是："手术成功后可能会发生什么？"
</p>

<p>
我不确定我是否会做出不同的选择，但我的选择会更加明智。
</p>
</blockquote>

<blockquote>
<p>
胶质母细胞瘤切除术是一座不通往任何地方的桥梁，因为手术后的一方是不完整的。
</p>

<p>
我们可以说，那边有路，但大多数情况下，路本身并不通向任何地方。
</p>

<p>
如果真的有路，胶质母细胞瘤就不会被诊断为绝症，像我这样的病人就能真正回到以前的生活。
</p>
</blockquote>

<blockquote>
<p>
每年都有数以千计的不幸者被诊断出患有胶质母细胞瘤，他们应该在遭受折磨的最初几天得到比我的经验所显示的要好得多的治疗。
</p>

<p>
他们应该了解真相&#x2013;所有的真相。他们应该被当作有能力的成年人对待。
</p>

<p>
他们不需要被呵护，仿佛不加修饰的真相会摧毁他们的求生意志。
</p>

<p>
他们不值得对下一代测序或个性化医疗的虚无赞美。
</p>

<p>
无论如何，请添加一些必要的措辞，说明不确定性和未知因素。
</p>

<p>
但无论如何，都不要掩盖基本事实。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgb3272a3" class="outline-3">
<h3 id="orgb3272a3"><a href="https://zverok.space/blog/2024-10-06-poetry.html">On programming and poetry (not Python’s tool)</a></h3>
<div class="outline-text-3" id="text-orgb3272a3">
<blockquote>
<p>
我们为什么要写作和阅读文学作品，任何文学作品？
</p>

<p>
主要是为了分享经历。一种去某个地方、经历某些事件、感受某些情绪、理解某些事情的体验。这种体验我们可能无法直接获取。
</p>

<p>
在这个定义的范围内，诗歌，一言以蔽之，是一种更有效地分享难以理性表达的经验的方式。
</p>

<p>
它依赖于某种理解上的“飞跃”，在这种情况下，一个精心制作的短语与五页密集的解释一样有效。
</p>
</blockquote>

<blockquote>
<p>
<b>we can say that writing code is sharing the experience of understanding the requirements/implementation.</b>
</p>

<p>
<b>我们可以说，编写代码就是分享理解需求/实现的经验。</b>
</p>
</blockquote>

<blockquote>
<p>
我希望看到更多的人以对待文学作品的心态来对待短语和“段落”（方法或语句组）层面上的代码。
</p>

<p>
我指的是一种视角，从这种视角出发，我们可以分析、讨论（也许还可以自学），从对潜在读者（包括人类和编译器/解释器）的影响的角度来思考
</p>

<p>
“在这种情况下，表达的含义是如何传达代码背后的思想的；是否可以用不同的方式来表达，以强调不同的方面”。
</p>

<p>
这种对话不像自动格式化和风格指南那么死板，也比抽象的“可读性”或“智能/简单代码”更加细致入微。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgb5982cc" class="outline-3">
<h3 id="orgb5982cc"><a href="https://mwhittaker.github.io/blog/an_illustrated_proof_of_the_cap_theorem/">An Illustrated Proof of the CAP Theorem</a></h3>
<div class="outline-text-3" id="text-orgb5982cc">
<p>
CAP 定理的图解证明，比较容易懂。
</p>
</div>
</div>

<div id="outline-container-orge1d47f2" class="outline-3">
<h3 id="orge1d47f2"><a href="https://www.dreamsongs.com/RiseOfWorseIsBetter.html">The Rise of Worse is Better</a></h3>
<div class="outline-text-3" id="text-orge1d47f2">
<blockquote>
<p>
从中可以学到的教训是，首先追求正确的事情往往是不理想的。
</p>

<p>
获取一半可用的正确事物更好，这样它就像病毒一样传播。
</p>

<p>
一旦人们对它上瘾，就花时间将其改进到 90% 的正确程度。
</p>
</blockquote>
</div>
</div>
