post/12.org
** [[https://kristoff.it/blog/static-site-paradox/][The Static Site Paradox]]

静态网站可以很简单，一个 HTML，找个服务器/托管商把网页丢上去就好了。

但是对于不懂 Web 技术的人而言，搭建个人网站，有可能使用了很复杂的技术栈。

作者建议让事情变得简单一些，让外行的人也容易参与进来。

#+begin_quote
在我看来，这很糟糕。这并不是因为我们抽象地崇尚简单，而是因为网络并不仅仅属于软件工程师。

我们越是将网络复杂化，就越是将普通用户推向我们喜欢称之为社交网络的封闭空间。
#+end_quote

#+begin_quote
当律师和会计师不解释他们的专业是如何运作的，使得你无法自己处理本来应该能搞定的事情，必须通过他们这个中间人时，你不觉得很生气吗？

在软件工程领域，尤其是网络开发领域，只要我们不能让简单的事情变得简单，我们就是在以同样的方式辜负社会。
#+end_quote

最近也看到一本类似想法的小册 [[https://plainvanillaweb.com/][Plain Vanilla]] ：

#+begin_quote
本书概述了制作网站和网络应用程序的主要技术，这些技术无需使用构建工具或框架，只需使用编辑器、浏览器和网络标准。
#+end_quote

** [[https://jakelazaroff.com/words/a-local-first-case-study/][A Local-First Case Study]]

作者因为需要规划旅游路线，但是没有找到符合自己需要的，于是写了一个应用。

你只需要像编写文本一样编写地点，地点就会在地图上标记出来，绘制成路线，看起来挺方便的。

同时，作者采用了本地优先的开发方式，使用 [[https://www.wikiwand.com/en/articles/Conflict-free_replicated_data_type][CRDT(Conflict-free replicated data type)]] 存储数据。

CRDT 带来的好处是，作者和妻子可以进行协同编辑。

关于 CRDT，作者还有一篇很好的交互式解释文章：[[https://jakelazaroff.com/words/an-interactive-intro-to-crdts/][An Interactive Intro to CRDTs]]。

** [[https://kristoff.it/blog/write-more/][How To Write More Blog Posts]]

作者提出了三大定律：

#+begin_quote
- 心理热力学第一定律
  + 除非你真正相信写作是一项有价值的精力投资，否则你将无法坚持不懈地完成写作。
  + 写作要明确以受欢迎为目标。
    * 如果你想写更多但却很难做到，那么以撰写一篇受欢迎的博文为明确目标的写作可能会有所帮助。
- 心理热力学第二定律
  + 一篇技术博文受欢迎的唯一原因是它能教给读者一些东西，除此之外别无其他！
  + 撰写一篇内容丰富的博文并不意味着它能教给读者任何东西。人们阅读时需要花费精力，而且他们可以阅读的东西太多了，这意味着他们也有自己的内在指南针。
- 心理热力学第三定律
  + 一篇引人入胜的博文应能有意或无意地识别出那些能从博文内容中立即受益的广泛人群。
  + 既然我们的目标是创作出受欢迎的作品，那么你就需要付出更多的努力，找到一个能让更多受众真正重视的全新视角。
  + 这可能需要您写一些您自己可能觉得微不足道的内容（考虑到您的专业知识），但一线希望是，您推动越多的人达到 X+1 的理解水平，您的主题就能越高级。


用一句话概括我的高水平建议：利用你的热情和对我们这门手艺的洞察力，让人们的理解更上一层楼，并换取社会证明，证明你的写作是有价值的。
#+end_quote

** [[https://css-tricks.com/searching-for-a-new-css-logo/][Searching for a New CSS Logo]]

CSS 现在的 logo 还是 CSS3 的 logo，但是现在很多 CSS4，CSS5 的特性也出来了，logo 就显得有些过时了。

社区在寻找一个新的 logo，新的 logo 设计看起来不错。

#+begin_export html
<iframe height="300" style="width: 100%;" scrolling="no" title="New CSS Logo (dinish) - RC3" src="https://codepen.io/argyleink/embed/vYoYmMa?default-tab=result" frameborder="no" loading="lazy" allowtransparency="true" allowfullscreen="true">
  See the Pen <a href="https://codepen.io/argyleink/pen/vYoYmMa">
  New CSS Logo (dinish) - RC3</a> by Adam Argyle (<a href="https://codepen.io/argyleink">@argyleink</a>)
  on <a href="https://codepen.io">CodePen</a>.
</iframe>
#+end_export

** [[https://htmx.org/essays/why-gumroad-didnt-choose-htmx/][Why Gumroad Didn't Choose htmx]]

#+begin_quote
值得注意的是，虽然这些挑战对于 htmx 来说并非不可克服，

但我们发现，解决这些挑战往往会让我们偏离 htmx 的优势，而采用在 JavaScript 繁重的环境中感觉更自然的解决方案。

这一认识是我们决定改用 React 和 Next.js 的关键因素。

我们承认，htmx 可能非常适合许多项目，尤其是那些交互模型较为简单的项目，或者那些建立在现有服务器渲染应用程序之上的项目。

我们的经验并不能否定其他人在 htmx 中发现的优势。

*关键是要了解项目的具体需求，并选择最符合这些需求的工具。*

尽管如此，随着需求的发展和新技术的出现，我们始终愿意重新评估我们的技术堆栈。谁知道未来会发生什么呢？
#+end_quote

在选择技术栈的时候，更重要的是和当前的业务匹配，而不是什么新颖，流行就用什么，合适才是最重要的。

** [[https://blog.sciencenet.cn/home.php?mod=space&uid=52727&do=blog&id=1444437][垫紫草的诱惑]]

#+begin_quote
我在 68 岁的年龄，爬上了海拔 4800 米的山岗，又看到了垫紫草，实现了另一个小目标。

在上山的路上疲惫不堪，我也曾想过要放弃，由于坚持，我看到垫紫草。

人生的目标，哪一个不是坚持才能实现的。
#+end_quote

** [[https://every.to/p/the-disappearance-of-an-internet-domain][The Disappearance of an Internet Domain]]

#+begin_quote
10 月 3 日，英国政府宣布放弃对印度洋上一个名为查戈斯群岛的热带小环礁的主权。

这些岛屿将移交给邻近的岛国毛里求斯，距离非洲东南海岸约 1100 英里。

科技媒体没有报道此事，但或许应该报道。

*将这些岛屿转让给新主人的决定将导致科技和游戏行业失去一个首选顶级域名：.io。*
#+end_quote

#+begin_quote
无论发生什么，对未来科技创始人的警示是明确的：在选择顶级域名时一定要谨慎。

*实体历史与数字未来永远不会像我们想象的那样分离。*
#+end_quote

这里有一些建议: [[https://tantek.com/2024/285/t1/io-domain-suggested-steps][.io domain¹ likely being phased-out² — seven suggested steps]]

* Tutorial

** [[https://garden.bradwoods.io/notes/communication/how-to-write][How to write]]

作者整理了关于自己写作的很多方面的内容，一篇很翔实的文章，推荐一读。

网站做得也很好看，作者的[[https://bradwoods.io/][个人页面]]，以及里面的 projects 也都很有意思。

如果你想看翻译的版本，可以看[[https://blog.gentlelucky.com/zh/2024/09/24/how-to-write/][这篇]]。

** [[https://evilmartians.com/chronicles/oklch-in-css-why-quit-rgb-hsl][OKLCH in CSS: why we moved from RGB and HSL]]

一篇关于 [[https://developer.mozilla.org/en-US/docs/Web/CSS/color_value/oklch][oklch()]] 的文章，对于为什么用，怎么用解释的很详细，也对比了和其他语法的差别。

#+begin_quote
=H= is the hue angle.

It goes from 0 to 360, through red 20, yellow 90, green 140, blue 220, purple 320 and then back to red.

You can use Roy G. Biv mnemonic by giving around 50° to each letter.
#+end_quote

其中关于如何记住色轮的值，作者提到了 [[https://www.wikiwand.com/en/articles/ROYGBIV][ROYGBIV]] 的方法，觉得还不错。

我觉得 "*R* ead  *O* ut  *Y* our  *G* ood  *B* ook  *I* n  *V* erse" 这句话还比较容易记忆。

** [[https://blog.logrocket.com/use-css-backdrop-filter-property/][How to use the CSS backdrop-filter property]]

关于 [[https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter][backdrop-filter]] 的使用介绍，有很多的例子。

backdrop-filter 可以给元素的背景增加滤镜效果，如模糊(blur)，灰度(grayScale)，反色(invert)，对比度(contrast)等。

** [[https://css-tricks.com/css-anchor-positioning-guide/][CSS Anchor Positioning Guide]]

[[https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_anchor_positioning][CSS anchor positioning]] 的教程，目前需要高版本浏览器才能看到效果（Chrome 125+）。

** [[https://badatcss.com][Bad@CSS]]

#+begin_quote
A podcast for those who are bad at CSS.
#+end_quote
** [[https://beej.us/guide/bgc/][Beej's Guide to C Programming]]

C 语言教程。

** [[https://www.cs.umd.edu/~nau/cmsc421/norvig-lisp-style.pdf][Tutorial on Good Lisp Programming Style]](1993)

Lisp 编程的一些好的实践，不过是 1993 年的教程，或许有的内容会过时。

** [[https://www.bilibili.com/video/BV1aD4y127GE][【高能干货】这个视频将会颠覆你对英语学习的认知——总述·阅读篇]]

英语学习资料 +1。

视频推荐的是 *可理解输入* ：

- 可理解 :: 输入的内容大部分能看懂，不需要反反复复查字典才能看明白
- 有趣 :: 如果内容无聊，就不会想主动地看下去，情绪上阻碍了自己
- 量大 :: 输入的量要足够的多

例如找一些国外低年级的课外阅读，比较容易看懂，也有趣味性，通过阅读，进行大量的可理解输入，语言能力就会自然地提升。

* Code

** [[https://www.jonashietala.se/blog/2024/08/25/a_simple_timeline_using_css_flexbox/][A simple timeline using CSS flexbox]]

使用 flexbox 绘制时间线。

** [[https://www.nodejs-security.com/blog/do-not-use-secrets-in-environment-variables-and-here-is-how-to-do-it-better][Do not use secrets in environment variables and here's how to do it better]]

将密钥等存储在环境变量中是很容易发生泄露的，而一旦泄露，可能会造成严重后果。

文章写了为什么不应该将秘密写在环境变量中，如果写在环境变量中，可能会通过什么方式导致泄露。

同时也给出了改进的建议。

