publish/12.html

<div id="outline-container-org9a3de46" class="outline-3">
<h3 id="org9a3de46"><a href="https://kristoff.it/blog/static-site-paradox/">The Static Site Paradox</a></h3>
<div class="outline-text-3" id="text-org9a3de46">
<p>
静态网站可以很简单，一个 HTML，找个服务器/托管商把网页丢上去就好了。
</p>

<p>
但是对于不懂 Web 技术的人而言，搭建个人网站，有可能使用了很复杂的技术栈。
</p>

<p>
作者建议让事情变得简单一些，让外行的人也容易参与进来。
</p>

<blockquote>
<p>
在我看来，这很糟糕。这并不是因为我们抽象地崇尚简单，而是因为网络并不仅仅属于软件工程师。
</p>

<p>
我们越是将网络复杂化，就越是将普通用户推向我们喜欢称之为社交网络的封闭空间。
</p>
</blockquote>

<blockquote>
<p>
当律师和会计师不解释他们的专业是如何运作的，使得你无法自己处理本来应该能搞定的事情，必须通过他们这个中间人时，你不觉得很生气吗？
</p>

<p>
在软件工程领域，尤其是网络开发领域，只要我们不能让简单的事情变得简单，我们就是在以同样的方式辜负社会。
</p>
</blockquote>

<p>
最近也看到一本类似想法的小册 <a href="https://plainvanillaweb.com/">Plain Vanilla</a> ：
</p>

<blockquote>
<p>
本书概述了制作网站和网络应用程序的主要技术，这些技术无需使用构建工具或框架，只需使用编辑器、浏览器和网络标准。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org873ca2c" class="outline-3">
<h3 id="org873ca2c"><a href="https://jakelazaroff.com/words/a-local-first-case-study/">A Local-First Case Study</a></h3>
<div class="outline-text-3" id="text-org873ca2c">
<p>
作者因为需要规划旅游路线，但是没有找到符合自己需要的，于是写了一个应用。
</p>

<p>
你只需要像编写文本一样编写地点，地点就会在地图上标记出来，绘制成路线，看起来挺方便的。
</p>

<p>
同时，作者采用了本地优先的开发方式，使用 <a href="https://www.wikiwand.com/en/articles/Conflict-free_replicated_data_type">CRDT(Conflict-free replicated data type)</a> 存储数据。
</p>

<p>
CRDT 带来的好处是，作者和妻子可以进行协同编辑。
</p>

<p>
关于 CRDT，作者还有一篇很好的交互式解释文章：<a href="https://jakelazaroff.com/words/an-interactive-intro-to-crdts/">An Interactive Intro to CRDTs</a>。
</p>
</div>
</div>

<div id="outline-container-org95f9376" class="outline-3">
<h3 id="org95f9376"><a href="https://kristoff.it/blog/write-more/">How To Write More Blog Posts</a></h3>
<div class="outline-text-3" id="text-org95f9376">
<p>
作者提出了三大定律：
</p>

<blockquote>
<ul class="org-ul">
<li>心理热力学第一定律
<ul class="org-ul">
<li>除非你真正相信写作是一项有价值的精力投资，否则你将无法坚持不懈地完成写作。</li>
<li>写作要明确以受欢迎为目标。
<ul class="org-ul">
<li>如果你想写更多但却很难做到，那么以撰写一篇受欢迎的博文为明确目标的写作可能会有所帮助。</li>
</ul></li>
</ul></li>
<li>心理热力学第二定律
<ul class="org-ul">
<li>一篇技术博文受欢迎的唯一原因是它能教给读者一些东西，除此之外别无其他！</li>
<li>撰写一篇内容丰富的博文并不意味着它能教给读者任何东西。人们阅读时需要花费精力，而且他们可以阅读的东西太多了，这意味着他们也有自己的内在指南针。</li>
</ul></li>
<li>心理热力学第三定律
<ul class="org-ul">
<li>一篇引人入胜的博文应能有意或无意地识别出那些能从博文内容中立即受益的广泛人群。</li>
<li>既然我们的目标是创作出受欢迎的作品，那么你就需要付出更多的努力，找到一个能让更多受众真正重视的全新视角。</li>
<li>这可能需要您写一些您自己可能觉得微不足道的内容（考虑到您的专业知识），但一线希望是，您推动越多的人达到 X+1 的理解水平，您的主题就能越高级。</li>
</ul></li>
</ul>


<p>
用一句话概括我的高水平建议：利用你的热情和对我们这门手艺的洞察力，让人们的理解更上一层楼，并换取社会证明，证明你的写作是有价值的。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org5978179" class="outline-3">
<h3 id="org5978179"><a href="https://css-tricks.com/searching-for-a-new-css-logo/">Searching for a New CSS Logo</a></h3>
<div class="outline-text-3" id="text-org5978179">
<p>
CSS 现在的 logo 还是 CSS3 的 logo，但是现在很多 CSS4，CSS5 的特性也出来了，logo 就显得有些过时了。
</p>

<p>
社区在寻找一个新的 logo，新的 logo 设计看起来不错。
</p>

<iframe height="300" style="width: 100%;" scrolling="no" title="New CSS Logo (dinish) - RC3" src="https://codepen.io/argyleink/embed/vYoYmMa?default-tab=result" frameborder="no" loading="lazy" allowtransparency="true" allowfullscreen="true">
  See the Pen <a href="https://codepen.io/argyleink/pen/vYoYmMa">
  New CSS Logo (dinish) - RC3</a> by Adam Argyle (<a href="https://codepen.io/argyleink">@argyleink</a>)
  on <a href="https://codepen.io">CodePen</a>.
</iframe>
</div>
</div>

<div id="outline-container-orgd2aee9c" class="outline-3">
<h3 id="orgd2aee9c"><a href="https://htmx.org/essays/why-gumroad-didnt-choose-htmx/">Why Gumroad Didn't Choose htmx</a></h3>
<div class="outline-text-3" id="text-orgd2aee9c">
<blockquote>
<p>
值得注意的是，虽然这些挑战对于 htmx 来说并非不可克服，
</p>

<p>
但我们发现，解决这些挑战往往会让我们偏离 htmx 的优势，而采用在 JavaScript 繁重的环境中感觉更自然的解决方案。
</p>

<p>
这一认识是我们决定改用 React 和 Next.js 的关键因素。
</p>

<p>
我们承认，htmx 可能非常适合许多项目，尤其是那些交互模型较为简单的项目，或者那些建立在现有服务器渲染应用程序之上的项目。
</p>

<p>
我们的经验并不能否定其他人在 htmx 中发现的优势。
</p>

<p>
<b>关键是要了解项目的具体需求，并选择最符合这些需求的工具。</b>
</p>

<p>
尽管如此，随着需求的发展和新技术的出现，我们始终愿意重新评估我们的技术堆栈。谁知道未来会发生什么呢？
</p>
</blockquote>

<p>
在选择技术栈的时候，更重要的是和当前的业务匹配，而不是什么新颖，流行就用什么，合适才是最重要的。
</p>
</div>
</div>

<div id="outline-container-org2b31739" class="outline-3">
<h3 id="org2b31739"><a href="https://blog.sciencenet.cn/home.php?mod=space&amp;uid=52727&amp;do=blog&amp;id=1444437">垫紫草的诱惑</a></h3>
<div class="outline-text-3" id="text-org2b31739">
<blockquote>
<p>
我在 68 岁的年龄，爬上了海拔 4800 米的山岗，又看到了垫紫草，实现了另一个小目标。
</p>

<p>
在上山的路上疲惫不堪，我也曾想过要放弃，由于坚持，我看到垫紫草。
</p>

<p>
人生的目标，哪一个不是坚持才能实现的。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgce0d4c2" class="outline-3">
<h3 id="orgce0d4c2"><a href="https://every.to/p/the-disappearance-of-an-internet-domain">The Disappearance of an Internet Domain</a></h3>
<div class="outline-text-3" id="text-orgce0d4c2">
<blockquote>
<p>
10 月 3 日，英国政府宣布放弃对印度洋上一个名为查戈斯群岛的热带小环礁的主权。
</p>

<p>
这些岛屿将移交给邻近的岛国毛里求斯，距离非洲东南海岸约 1100 英里。
</p>

<p>
科技媒体没有报道此事，但或许应该报道。
</p>

<p>
<b>将这些岛屿转让给新主人的决定将导致科技和游戏行业失去一个首选顶级域名：.io。</b>
</p>
</blockquote>

<blockquote>
<p>
无论发生什么，对未来科技创始人的警示是明确的：在选择顶级域名时一定要谨慎。
</p>

<p>
<b>实体历史与数字未来永远不会像我们想象的那样分离。</b>
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org6e7b20e" class="outline-2">
<h2 id="org6e7b20e">Tutorial</h2>
<div class="outline-text-2" id="text-org6e7b20e">
</div>
<div id="outline-container-org0e90cf9" class="outline-3">
<h3 id="org0e90cf9"><a href="https://garden.bradwoods.io/notes/communication/how-to-write">How to write</a></h3>
<div class="outline-text-3" id="text-org0e90cf9">
<p>
作者整理了关于自己写作的很多方面的内容，一篇很翔实的文章，推荐一读。
</p>

<p>
网站做得也很好看，作者的<a href="https://bradwoods.io/">个人页面</a>，以及里面的 projects 也都很有意思。
</p>

<p>
如果你想看翻译的版本，可以看<a href="https://blog.gentlelucky.com/zh/2024/09/24/how-to-write/">这篇</a>。
</p>
</div>
</div>

<div id="outline-container-org0c1c3d3" class="outline-3">
<h3 id="org0c1c3d3"><a href="https://evilmartians.com/chronicles/oklch-in-css-why-quit-rgb-hsl">OKLCH in CSS: why we moved from RGB and HSL</a></h3>
<div class="outline-text-3" id="text-org0c1c3d3">
<p>
一篇关于 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value/oklch">oklch()</a> 的文章，对于为什么用，怎么用解释的很详细，也对比了和其他语法的差别。
</p>

<blockquote>
<p>
<code>H</code> is the hue angle.
</p>

<p>
It goes from 0 to 360, through red 20, yellow 90, green 140, blue 220, purple 320 and then back to red.
</p>

<p>
You can use Roy G. Biv mnemonic by giving around 50° to each letter.
</p>
</blockquote>

<p>
其中关于如何记住色轮的值，作者提到了 <a href="https://www.wikiwand.com/en/articles/ROYGBIV">ROYGBIV</a> 的方法，觉得还不错。
</p>

<p>
我觉得 "<b>R</b> ead  <b>O</b> ut  <b>Y</b> our  <b>G</b> ood  <b>B</b> ook  <b>I</b> n  <b>V</b> erse" 这句话还比较容易记忆。
</p>
</div>
</div>

<div id="outline-container-org1aa4cd4" class="outline-3">
<h3 id="org1aa4cd4"><a href="https://blog.logrocket.com/use-css-backdrop-filter-property/">How to use the CSS backdrop-filter property</a></h3>
<div class="outline-text-3" id="text-org1aa4cd4">
<p>
关于 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter">backdrop-filter</a> 的使用介绍，有很多的例子。
</p>

<p>
backdrop-filter 可以给元素的背景增加滤镜效果，如模糊(blur)，灰度(grayScale)，反色(invert)，对比度(contrast)等。
</p>
</div>
</div>

<div id="outline-container-orge0577dd" class="outline-3">
<h3 id="orge0577dd"><a href="https://css-tricks.com/css-anchor-positioning-guide/">CSS Anchor Positioning Guide</a></h3>
<div class="outline-text-3" id="text-orge0577dd">
<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_anchor_positioning">CSS anchor positioning</a> 的教程，目前需要高版本浏览器才能看到效果（Chrome 125+）。
</p>
</div>
</div>

<div id="outline-container-orgea4d085" class="outline-3">
<h3 id="orgea4d085"><a href="https://badatcss.com">Bad@CSS</a></h3>
<div class="outline-text-3" id="text-orgea4d085">
<blockquote>
<p>
A podcast for those who are bad at CSS.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgf69367f" class="outline-3">
<h3 id="orgf69367f"><a href="https://beej.us/guide/bgc/">Beej's Guide to C Programming</a></h3>
<div class="outline-text-3" id="text-orgf69367f">
<p>
C 语言教程。
</p>
</div>
</div>

<div id="outline-container-org5df105b" class="outline-3">
<h3 id="org5df105b"><a href="https://www.cs.umd.edu/~nau/cmsc421/norvig-lisp-style.pdf">Tutorial on Good Lisp Programming Style</a>(1993)</h3>
<div class="outline-text-3" id="text-org5df105b">
<p>
Lisp 编程的一些好的实践，不过是 1993 年的教程，或许有的内容会过时。
</p>
</div>
</div>

<div id="outline-container-org5299778" class="outline-3">
<h3 id="org5299778"><a href="https://www.bilibili.com/video/BV1aD4y127GE">【高能干货】这个视频将会颠覆你对英语学习的认知——总述·阅读篇</a></h3>
<div class="outline-text-3" id="text-org5299778">
<p>
英语学习资料 +1。
</p>
</div>
</div>
</div>

<div id="outline-container-org5bf2ed9" class="outline-2">
<h2 id="org5bf2ed9">Code</h2>
<div class="outline-text-2" id="text-org5bf2ed9">
</div>
<div id="outline-container-org5e2e979" class="outline-3">
<h3 id="org5e2e979"><a href="https://www.jonashietala.se/blog/2024/08/25/a_simple_timeline_using_css_flexbox/">A simple timeline using CSS flexbox</a></h3>
<div class="outline-text-3" id="text-org5e2e979">
<p>
使用 flexbox 绘制时间线。
</p>
</div>
</div>

<div id="outline-container-org9c7d2e9" class="outline-3">
<h3 id="org9c7d2e9"><a href="https://www.nodejs-security.com/blog/do-not-use-secrets-in-environment-variables-and-here-is-how-to-do-it-better">Do not use secrets in environment variables and here's how to do it better</a></h3>
<div class="outline-text-3" id="text-org9c7d2e9">
<p>
将密钥等存储在环境变量中是很容易发生泄露的，而一旦泄露，可能会造成严重后果。
</p>

<p>
文章写了为什么不应该将秘密写在环境变量中，如果写在环境变量中，可能会通过什么方式导致泄露。
</p>

<p>
同时也给出了改进的建议。
</p>
</div>
</div>
